Tekla Open API Reference for Tekla Structures 2025
ReinforcementMeshAttributes Properties
The ReinforcementBase.ReinforcementMeshAttributes type exposes the following members.
Properties
Name | Description
CustomPresentation
 Custom presentation GUID to be applied to the object type
 (Inherited from ReinforcementBase.ReinforcementBaseAttributes.)
HiddenLines
 The line type of the hidden lines of the reinforcement.
 (Inherited from ReinforcementBase.ReinforcementBaseAttributes.)
HideLinesHiddenByPart
 Defines whether lines hidden by parts should be hidden or not.
 (Inherited from ReinforcementBase.ReinforcementBaseAttributes.)
HideLinesHiddenByReinforcement
 Defines whether lines hidden by reinforcements should be hidden or not.
 (Inherited from ReinforcementBase.ReinforcementBaseAttributes.)
MeshReinforcementSymbolIndex
 Defines the index for the mesh symbol to be used. The mesh symbol appears in the middle of the mesh line when ReinforcementRepresentation == OutLine. The index starts from 0 and corresponds to the symbol in the file mesh.sym.
MeshReinforcementSymbolSize
 Defines the size of the reinforcement mesh symbol.
MeshReinforcementVisibilityCrossing
 Defines which crossing bars in the mesh appear in drawings.
MeshReinforcementVisibilityLongitudinal
 Defines which longitudinal wires in the mesh appear in drawings.
ReinforcementRepresentation
 The representation of reinforcing bars.
 (Inherited from ReinforcementBase.ReinforcementBaseAttributes.)
VisibleLines
 The line type of the visible lines of the reinforcement.
 (Inherited from ReinforcementBase.ReinforcementBaseAttributes.)
Top
See Also
Reference
ReinforcementBase.ReinforcementMeshAttributes Class
Tekla.Structures.Drawing Namespace